In [1]:
import pandas as pd

In [2]:
from janitor import clean_names

## MVP

## Joins


**Question 1**

Read in all 4 credit card transaction datasets and clean up the column names.

-    CardBase.csv
-    CustomerBase.csv
-    FraudBase.csv
-    TransactionBase.csv

In [3]:
cards = pd.read_csv("data/CardBase.csv").clean_names()
customers = pd.read_csv("data/CustomerBase.csv").clean_names()
fraud = pd.read_csv("data/FraudBase.csv").clean_names()
transactions = pd.read_csv("data/TransactionBase.csv").clean_names()

**Question 2**

Join the data containing card details and customer details by customer id, so that all records of card details and any matching records in customer details are kept.

In [4]:
cards.columns

Index(['card_number', 'card_family', 'credit_limit', 'cust_id'], dtype='object')

In [5]:
customers.columns

Index(['cust_id', 'age', 'customer_segment', 'customer_vintage_group'], dtype='object')

In [6]:
cards.merge(customers, how = "left", on = "cust_id")

,card_number,card_family,credit_limit,cust_id,age,customer_segment,customer_vintage_group
0,8638-5407-3631-8196,Premium,530000,CC67088,27,Diamond,VG1
1,7106-4239-7093-1515,Gold,18000,CC12076,48,Gold,VG3
2,6492-5655-8241-3530,Premium,596000,CC97173,22,Diamond,VG1
3,2868-5606-5152-5706,Gold,27000,CC55858,30,Diamond,VG1
4,1438-6906-2509-8219,Platinum,142000,CC90518,50,Platinum,VG2
...,...,...,...,...,...,...,...
495,4708-4407-9601-6022,Premium,691000,CC64993,34,Diamond,VG1
496,6042-2856-7280-2925,Gold,33000,CC26787,46,Platinum,VG2
497,8706-3809-5167-3899,Premium,144000,CC32532,28,Platinum,VG2
498,9540-8558-5897-5046,Premium,830000,CC90246,35,Gold,VG3
499,5587-7265-8118-7718,Gold,24000,CC37803,21,Diamond,VG1


**Question 3**

Join the data containing fraud details with transaction details so all rows of both tables are kept. What does the resulting row number tell you?

In [7]:
fraud.columns

Index(['transaction_id', 'fraud_flag'], dtype='object')

In [8]:
transactions.columns

Index(['transaction_id', 'transaction_date', 'credit_card_id',
       'transaction_value', 'transaction_segment'],
      dtype='object')

In [9]:
fraud.merge(transactions, how = "outer", on = "transaction_id")

,transaction_id,fraud_flag,transaction_date,credit_card_id,transaction_value,transaction_segment
0,CTID50558449,1.0,6-May-16,4246-1369-3659-8804,6984,SEG23
1,CTID55936882,1.0,29-Nov-16,1336-9200-1264-2551,34367,SEG21
2,CTID63762180,1.0,5-Dec-16,8528-6154-7390-5081,44550,SEG15
3,CTID76723439,1.0,15-Sep-16,7908-2695-7391-7499,48275,SEG16
4,CTID21246201,1.0,29-Feb-16,2524-4184-5908-6750,35751,SEG25
...,...,...,...,...,...,...
9995,CTID25037573,NaN,10-Jun-16,9157-2802-8374-1145,44280,SEG18
9996,CTID43832298,NaN,23-May-16,7416-4529-6690-5703,27163,SEG12
9997,CTID56532072,NaN,6-Aug-16,6699-2639-4522-6219,36424,SEG13
9998,CTID88101446,NaN,10-Oct-16,8341-5263-4582-7396,8464,SEG14
9999,CTID64730271,NaN,18-Jun-16,1947-8602-1695-7503,7606,SEG15

In [10]:
transactions.shape

(10000, 5)

In [11]:
fraud.shape

(109, 2)

This tell us that there is a relationship one-to-many between `fraud` and `transactions`


**Question 4**

[Harder] Perform a filtering join between cards and transactions so that only the card details for cards that have made at least one transaction are preserved.

Hint: semi is not an allowed option for how in .merge(). You'll need to think about the process of a semi join and then perform each step.

In [12]:
#I am going to remove all the duplicates in transactions 
transactions_without_dup = transactions.drop_duplicates("credit_card_id", keep = "first")

cards.merge(transactions_without_dup, how = "inner", left_on = "card_number", right_on = "credit_card_id")

,card_number,card_family,credit_limit,cust_id,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,8638-5407-3631-8196,Premium,530000,CC67088,CTID85973577,13-Feb-16,8638-5407-3631-8196,31592,SEG21
1,7106-4239-7093-1515,Gold,18000,CC12076,CTID42568651,31-Jan-16,7106-4239-7093-1515,28695,SEG11
2,6492-5655-8241-3530,Premium,596000,CC97173,CTID79611141,10-Nov-16,6492-5655-8241-3530,40319,SEG17
3,2868-5606-5152-5706,Gold,27000,CC55858,CTID98358171,12-May-16,2868-5606-5152-5706,19701,SEG19
4,1438-6906-2509-8219,Platinum,142000,CC90518,CTID65915545,17-Oct-16,1438-6906-2509-8219,8022,SEG22
...,...,...,...,...,...,...,...,...,...
495,4708-4407-9601-6022,Premium,691000,CC64993,CTID90182533,24-Jul-16,4708-4407-9601-6022,8630,SEG11
496,6042-2856-7280-2925,Gold,33000,CC26787,CTID83549292,3-Apr-16,6042-2856-7280-2925,13436,SEG21
497,8706-3809-5167-3899,Premium,144000,CC32532,CTID18591064,5-Jun-16,8706-3809-5167-3899,46113,SEG19
498,9540-8558-5897-5046,Premium,830000,CC90246,CTID12471151,13-Jun-16,9540-8558-5897-5046,12367,SEG13
499,5587-7265-8118-7718,Gold,24000,CC37803,CTID60694669,27-Apr-16,5587-7265-8118-7718,16479,SEG24

## Tidy data

**Question 5**

Read in `hat_observations` and split observation into two columns, `hat_colour` and `hat_type`.

Hint: Look up the pandas documentation for `.str.split()`

In [13]:
hat_observations = pd.read_csv("data/hat_observations.csv")
hat_observations.head()

   day  month  year      observation  observation_count
0   25     10  2019      black,beret                  7
1   11      9  2019     blue,top hat                 10
2    4     12  2018  green,santa hat                  9
3   18      6  2018      white,beret                  9
4   26      9  2018  black,santa hat                  1

In [14]:
hat_observations[["hat_colour", "hat_type"]] = hat_observations.observation.str.split(",", expand = True)
hat_observations.drop(columns={'observation'}, inplace=True)
hat_observations

    day  month  year  observation_count hat_colour    hat_type
0    25     10  2019                  7      black       beret
1    11      9  2019                 10       blue     top hat
2     4     12  2018                  9      green   santa hat
3    18      6  2018                  9      white       beret
4    26      9  2018                  1      black   santa hat
..  ...    ...   ...                ...        ...         ...
95   15      8  2018                  8     purple  bucket hat
96   26      1  2018                  5      green  bowler hat
97   15     11  2018                  7      black     top hat
98   14      9  2019                  4      green      helmet
99    1     10  2018                  4       blue      fedora

[100 rows x 6 columns]


**Question 6**

Unite `day`, `month`, and `year` columns into a column called `date` using a suitable separator. Then find the date where the most berets were observed.

Hints:

 -   you can use the `.agg()` function to combine columns
 -   you may need to convert the data types of the columns you wish to combine

In [15]:
hat_observations["date"] = hat_observations[["day", "month", "year"]].astype("str").agg("/".join, axis = 1) 
#axis = 1 means that you want to aggregate columns
hat_observations

    day  month  year  observation_count hat_colour    hat_type        date
0    25     10  2019                  7      black       beret  25/10/2019
1    11      9  2019                 10       blue     top hat   11/9/2019
2     4     12  2018                  9      green   santa hat   4/12/2018
3    18      6  2018                  9      white       beret   18/6/2018
4    26      9  2018                  1      black   santa hat   26/9/2018
..  ...    ...   ...                ...        ...         ...         ...
95   15      8  2018                  8     purple  bucket hat   15/8/2018
96   26      1  2018                  5      green  bowler hat   26/1/2018
97   15     11  2018                  7      black     top hat  15/11/2018
98   14      9  2019                  4      green      helmet   14/9/2019
99    1     10  2018                  4       blue      fedora   1/10/2018

[100 rows x 7 columns]

In [17]:
hat_observations.loc[hat_observations.hat_type == "beret"].drop(columns = ["day", "month", "year"]) \
.groupby("date", as_index = False).agg(obs_date_beret = ("observation_count", "sum")) \
.sort_values("obs_date_beret", ascending = False).head(1)

        date  obs_date_beret
2  18/6/2018              11

## Extensions

## Joins

**Question 1**

Can you join all 4 credit card datasets together so that youâ€™re left with a dataset that looks like below with 109 rows and 12 columns?

In [18]:
cards.head(1)

           card_number card_family  credit_limit  cust_id
0  8638-5407-3631-8196     Premium        530000  CC67088

In [19]:
customers.head(1)

   cust_id  age customer_segment customer_vintage_group
0  CC25034   35          Diamond                    VG1

In [20]:
fraud.head(1)

  transaction_id  fraud_flag
0   CTID50558449           1

In [21]:
transactions.head(1)

,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25

In [22]:
cards.shape

(500, 4)

In [23]:
customers.shape

(5674, 4)

In [24]:
fraud.shape

(109, 2)

In [25]:
transactions.shape

(10000, 5)

In [33]:
cards.merge(customers, how = "inner", on = "cust_id") \
.merge(transactions, how = "inner", left_on = "card_number", right_on = "credit_card_id") \
.merge(fraud, how = "inner", on = "transaction_id") \
.drop(columns = "credit_card_id").set_index("card_number")

,card_family,credit_limit,cust_id,age,customer_segment,customer_vintage_group,transaction_id,transaction_date,transaction_value,transaction_segment,fraud_flag
card_number,,,,,,,,,,,
7214-4915-6387-5429,Platinum,172000,CC72302,22,Diamond,VG1,CTID87470159,11-Mar-16,32198,SEG21,1
6239-8641-8524-9441,Gold,26000,CC18438,41,Diamond,VG1,CTID40881434,10-Sep-16,43482,SEG15,1
6228-9033-3508-8121,Gold,33000,CC36771,50,Diamond,VG1,CTID42980186,17-Feb-16,45625,SEG22,1
6228-9033-3508-8121,Gold,33000,CC36771,50,Diamond,VG1,CTID33699337,16-Apr-16,14442,SEG16,1
1466-1600-9312-7604,Premium,249000,CC60926,24,Diamond,VG1,CTID25962688,18-Aug-16,45807,SEG20,1
...,...,...,...,...,...,...,...,...,...,...,...
1947-8327-3848-6581,Platinum,113000,CC11690,24,Diamond,VG1,CTID16281374,6-Sep-16,34290,SEG21,1
9018-5320-5729-5393,Premium,444000,CC54582,29,Gold,VG3,CTID30494187,31-Dec-16,14586,SEG20,1
2949-1972-1300-6680,Gold,45000,CC68567,31,Platinum,VG2,CTID68584964,31-Dec-16,18851,SEG22,1
5384-8278-5616-5502,Premium,361000,CC83124,35,Gold,VG3,CTID38931999,28-Sep-16,29079,SEG23,1
9542-6082-9630-9970,Platinum,159000,CC66351,22,Platinum,VG2,CTID88342446,21-Apr-16,32930,SEG14,1

## Tidy data

**Question 2**

Read in `exam_scores` and transform it into `long format` with two new columns `exam_question` and `score`. Remove superfluous information from the values in `exam_question`.

In [35]:
exam_scores = pd.read_csv("data/exam_scores.csv")

In [36]:
exam_scores.head(1)

,id,exam_Q1,exam_Q2,exam_Q3,exam_Q4,exam_Q5,exam_Q6,exam_Q7,exam_Q8,exam_Q9,exam_Q10
0,1,69,59,95,56,54,78,86,99,34,47

In [39]:
exams_melted = exam_scores.melt(
    id_vars = ["id"],
    var_name = "exams",
    value_name = "score"
)
exams_melted

       id     exams  score
0       1   exam_Q1     69
1       2   exam_Q1     37
2       3   exam_Q1     38
3       4   exam_Q1     49
4       5   exam_Q1     40
...   ...       ...    ...
1995  196  exam_Q10     54
1996  197  exam_Q10     28
1997  198  exam_Q10     28
1998  199  exam_Q10     67
1999  200  exam_Q10     33

[2000 rows x 3 columns]

In [42]:
#Correction
exams_melted.assign(exams = exams_melted['exams'].str.split('_Q',expand = True)[1])
#N.B. before we imposed that we wanted to split into two columns, so we had two columns and bothe the words 'before' and
#'after' the comma. Now, we only selected the 'exams' columns, so it assigned it only the value 'after' the separator!

       id exams  score
0       1     1     69
1       2     1     37
2       3     1     38
3       4     1     49
4       5     1     40
...   ...   ...    ...
1995  196    10     54
1996  197    10     28
1997  198    10     28
1998  199    10     67
1999  200    10     33

[2000 rows x 3 columns]